In [1]:
import pandas as pd
import warnings
warnings.filterwarnings("ignore")
import numpy as np

In [2]:
raw_cb = pd.read_sas('CBQ_I.XPT')

columns to keep:

CBD071 - Money spent at supermarket/grocery store (discrete)

CBD111 - Money spent on food at other stores (discrete)

CBD121 - Money spent on eating out (discrete)

CBD131 - Money spent on carryout/delivered foods (discrete)

In [3]:
cb_cols_to_keep = ['SEQN', 'CBD071', 'CBD111', 'CBD121', 'CBD131']

In [4]:
cb_df = raw_cb[cb_cols_to_keep]

In [5]:
cb_df.head()

      SEQN  CBD071        CBD111        CBD121        CBD131
0  83732.0   300.0  5.397605e-79  1.250000e+02  5.397605e-79
1  83733.0   200.0  5.000000e+01  4.000000e+01  5.397605e-79
2  83734.0   400.0  5.397605e-79  5.397605e-79  5.397605e-79
3  83735.0   300.0  2.500000e+02  5.000000e+01  5.397605e-79
4  83736.0   300.0  5.397605e-79  2.000000e+02  5.397605e-79

In [6]:
cb_df.shape

(9971, 5)

In [7]:
cb_df.isna().sum()

SEQN        0
CBD071    329
CBD111    329
CBD121    329
CBD131    329
dtype: int64

In [12]:
#change all < 1 values to 0
cb_df.loc[cb_df['CBD071'] < 1, 'CBD071'] = 0
cb_df.loc[cb_df['CBD111'] < 1, 'CBD111'] = 0
cb_df.loc[cb_df['CBD121'] < 1, 'CBD121'] = 0
cb_df.loc[cb_df['CBD131'] < 1, 'CBD131'] = 0

In [16]:
cb_df.head()

      SEQN  CBD071  CBD111  CBD121  CBD131
0  83732.0   300.0     0.0   125.0     0.0
1  83733.0   200.0    50.0    40.0     0.0
2  83734.0   400.0     0.0     0.0     0.0
3  83735.0   300.0   250.0    50.0     0.0
4  83736.0   300.0     0.0   200.0     0.0

In [18]:
cb_df.loc[cb_df['CBD071'] > 9000, 'CBD071'] = np.NaN #convert 777777 and 999999 into NaN
cb_df.loc[cb_df['CBD111'] > 9000, 'CBD111'] = np.NaN #convert 777777 and 999999 into NaN
cb_df.loc[cb_df['CBD121'] > 9000, 'CBD121'] = np.NaN
cb_df.loc[cb_df['CBD131'] > 9000, 'CBD131'] = np.NaN

In [19]:
cb_df.isna().sum()

SEQN        0
CBD071    471
CBD111    454
CBD121    607
CBD131    470
dtype: int64

In [23]:
cb_df.rename(columns={'CBD071':'Money_spent_at_supermarket_grocery_store', 'CBD111':'Money_spent_on_food_at_other_stores', 
                      'CBD121':'Money_spent_eating_out', 'CBD131':'Money_spent_carryout_delivered_foods'}, inplace=True)

In [24]:
cb_df.head()

,SEQN,Money_spent_at_supermarket_grocery_store,Money_spent_on_food_at_other_stores,Money_spent_eating_out,Money_spent_carryout_delivered_foods
0,83732.0,300.0,0.0,125.0,0.0
1,83733.0,200.0,50.0,40.0,0.0
2,83734.0,400.0,0.0,0.0,0.0
3,83735.0,300.0,250.0,50.0,0.0
4,83736.0,300.0,0.0,200.0,0.0

In [25]:
cb_df.to_csv('Consumer_Behavior_Questionnaire_Data.csv')